tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "actionlint"
brew "bash-language-server"
brew "bat"
brew "chezmoi"
brew "direnv"
brew "doggo"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "glow"
brew "gnuplot"
brew "helix"
brew "hyperfine"
brew "jj"
brew "jless"
brew "jq"
brew "marksman"
brew "minisign"
brew "oxipng"
brew "pastel"
brew "prettier"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "taplo"
brew "tig"
brew "tree"
brew "typos-cli"
brew "vale"
brew "yaml-language-server"

cask "font-cascadia-code"
cask "font-fira-code"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-victor-mono"
cask "google-cloud-sdk"
cask "meld"
cask "musescore"
cask "wezterm"

# These casks can be installed, but not upgraded by brew (they update themselves)
#
#     $ brew info --cask --json=v2 (brew ls --cask) | jq -r '.casks[]|select(.auto_updates==true)|.token'
#
cask "appcleaner"
cask "firefox"
cask "google-cloud-sdk"
cask "obsidian"
cask "rectangle"
cask "stats"
cask "tailscale"
cask "transmission"
cask "vlc"
