tap "EarthmanMuons/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "actionlint"
brew "aria2"
brew "bash-language-server"
brew "bat"
brew "bitwarden-cli"
brew "chezmoi"
brew "doggo"
brew "dua-cli"
brew "eslint"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "git"
brew "glow"
brew "gnuplot"
brew "gofumpt"
brew "gopls"
brew "helix"
brew "hyperfine"
brew "imagemagick"
brew "jj"
brew "jless"
brew "jq"
brew "lua-language-server"
brew "marksman"
brew "minisign"
brew "mise"
brew "neofetch"
brew "pastel"
brew "prettier"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "stylelint"
brew "stylua"
brew "swiftlint"
brew "tig"
brew "tombi"
brew "transcribe"
brew "tree"
brew "typos-cli"
brew "typst"
brew "vale"
brew "watchexec"
brew "whosthere"
brew "yaml-language-server"
brew "yazi"
brew "yt-dlp"
brew "zizmor"
brew "zmx-picker"

cask "font-0xproto"
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-victor-mono"
cask "losslesscut"
cask "transcribe"
cask "utm"

# These applications include built-in auto-update mechanisms.
#
#     $ brew info --cask --json=v2 (brew ls --cask) | jq -r '.casks[]|select(.auto_updates==true)|.token'
#
cask "appcleaner"
cask "brave-browser"
cask "firefox"
cask "flutter"
cask "gcloud-cli"
cask "ghostty"
cask "iina"
cask "mullvad-vpn"
cask "musescore"
cask "obsidian"
cask "stats"
cask "tailscale"
cask "zen"
